package com.formax.scala

/**
 * 算术运算符： + - * / %
 * 关系运算符：==,!=,>,<,>=,<=
 * 逻辑运算符：&& 逻辑与,||逻辑或,!逻辑非
 * 位运算符：~取反，&按位与,|按位或,^按位与异或,<<左移动,>>右移动,>>>无符号右移动 
 * 赋值运算符：=,+=,-=,*=,/=,%=,<<=按位左移再赋值,>>=按位右移再赋值,&=按位与后再赋值,^按位异或后再赋值,|=按位或后再赋值
 * 运算符优先级：'()[]' > '! ~' > '* % /' > '+ -' > '>> >>> <<' > '> >= < <=' > '==,!=' > '&' > '^' > '|' > '&&' > '||' > '= += -= *= /= %= >>= <<= &= ^= |='
 */
object Operator {
  def main(args: Array[String]): Unit = {
    var a = 3
    var b = 5.0
    var c = 2
    var d = 4
    var e = 7
    println("a + b = " + (a + b))
    println("a - b = " + (a - b))
    println("a * b = " + (a * b))
    println("a / b = " + (a / b))
    println("a % b = " + (a % b))
  }
}